-- Add articles categories
INSERT INTO categories (label) VALUES
('Жизнь и путешествия'),
('Путешествия'),
('Дизайн и программирование'),
('Другое'),
('Личное'),
('Дизайн'),
('Дизайн и обустройство'),
('Удаленная работа'),
('Фриланс'),
('Автомобили'),
('Бизнес'),
('Производство игрушек'),
('UX & UI');

-- Add app users
INSERT INTO users (first_name, last_name, email, avatar) VALUES
('Иван','Иванов', 'ivanov@ya.ru','avatar-1.png'),
('Алёна','Фролова', 'frolova@ya.ru','avatar-2.png'),
('Дина','Петрова', 'petrova@ya.ru','avatar-3.png'),
('Карина','Валиева', 'valieva@ya.ru','avatar-4.png'),
('Пётр','Сидоров', 'sidorov@ya.ru','avatar-5.png');

-- Add articles
INSERT INTO articles (title, picture, announce, full_text, user_id, created_at) VALUES
('Рок — это протест','forest@1x.jpg','Рок-музыка всегда ассоциировалась с протестами.','Рок-музыка всегда ассоциировалась с протестами. Так ли это на самом деле?',1,'2020-01-23'),
('Как перестать беспокоиться и начать жить','sea-fullsize@1x.jpg','Бороться с прокрастинацией несложно.','Бороться с прокрастинацией несложно. Просто действуйте. Маленькими шагами.',2,'2020-04-01'),
('Обзор новейшего смартфона','sea@1x.jpg','Этот смартфон — настоящая находка.','Этот смартфон — настоящая находка. Большой и яркий экран, мощнейший процессор — всё это в небольшом гаджете.',3,'2020-10-10'),
('Самый лучший музыкальный альбом этого года','skyscraper@1x.jpg','Альбом стал настоящим открытием года.','Альбом стал настоящим открытием года. Мощные гитарные рифы и скоростные соло-партии не дадут заскучать.',1,'2020-12-01');

-- Add relations between articles and categories
INSERT INTO article_categories (article_id, category_id) VALUES
(1, 4),
(2, 1),
(3, 3),
(4, 4);

-- Add comments for articles
INSERT INTO comments (article_id, user_id, text, created_at) VALUES
(1, 1, 'Согласен с автором!', '2020-01-23'),
(1, 2, 'Плюсую, но слишком много буквы!', '2020-01-24'),
(2, 3, 'Мне кажется или я уже читал это где-то?', '2020-04-01'),
(2, 4, 'Планируете записать видосик на эту тему?', '2020-04-03'),
(3, 5, 'Совсем немного...', '2020-10-10'),
(3, 1, 'Согласен с автором!', '2020-10-19'),
(4, 2, 'Плюсую, но слишком много буквы!', '2020-12-01'),
(4, 3, 'Хочу такую же футболку :-)', '2020-12-12');
